In [1]:
import pandas as pd

# Sample structure based on toyota_sales_data.csv
data = [
    {"sale_id": 1, "sale_rep_id": 101, "sale_date": "2024-01-01", "car_model": "Camry", "sale_amount": "20000", "commission_pct": 5, "sale_status": "Completed"},
    {"sale_id": 2, "sale_rep_id": 102, "sale_date": "2024-01-02", "car_model": "Corolla", "sale_amount": "18000", "commission_pct": 4, "sale_status": "Completed"},
    {"sale_id": 3, "sale_rep_id": 103, "sale_date": "2024-01-03", "car_model": "RAV4", "sale_amount": "30000", "commission_pct": 6, "sale_status": "Completed"},
    {"sale_id": 4, "sale_rep_id": 104, "sale_date": "2024-01-04", "car_model": "Highlander", "sale_amount": "35000", "commission_pct": 7, "sale_status": "Pending"},
]

df = pd.DataFrame(data)

In [2]:
df

,sale_id,sale_rep_id,sale_date,car_model,sale_amount,commission_pct,sale_status
0,1,101,2024-01-01,Camry,20000,5,Completed
1,2,102,2024-01-02,Corolla,18000,4,Completed
2,3,103,2024-01-03,RAV4,30000,6,Completed
3,4,104,2024-01-04,Highlander,35000,7,Pending

In [3]:
df.dtypes

sale_id            int64
sale_rep_id        int64
sale_date         object
car_model         object
sale_amount       object
commission_pct     int64
sale_status       object
dtype: object

In [4]:
df["sale_date"] = pd.to_datetime(df["sale_date"])

In [5]:
df["sale_amount"] = pd.to_numeric(df["sale_amount"])

In [6]:
df.dtypes

sale_id                    int64
sale_rep_id                int64
sale_date         datetime64[ns]
car_model                 object
sale_amount                int64
commission_pct             int64
sale_status               object
dtype: object

In [7]:
df

,sale_id,sale_rep_id,sale_date,car_model,sale_amount,commission_pct,sale_status
0,1,101,2024-01-01,Camry,20000,5,Completed
1,2,102,2024-01-02,Corolla,18000,4,Completed
2,3,103,2024-01-03,RAV4,30000,6,Completed
3,4,104,2024-01-04,Highlander,35000,7,Pending

In [8]:
toyota_data = pd.read_csv("data/car_sales/toyota_sales_data.csv")

In [9]:
toyota_data

,sale_id,sale_rep_id,sale_date,car_model,sale_amount,commission_pct,sale_status
0,1,16,2024-11-18,Tundra,44496.88,0.05,Completed
1,2,11,2024-11-08,Tacoma,34824.72,NaN,Pending
2,3,5,2024-11-03,Corolla,20275.08,NaN,Completed
3,4,20,2024-11-06,Corolla,20068.93,NaN,Completed
4,5,1,2024-11-26,Tundra,49811.99,0.03,Completed
...,...,...,...,...,...,...,...
4995,4996,1,2024-11-06,Corolla,21484.83,0.05,Completed
4996,4997,8,2024-11-11,Camry,26519.24,0.05,Pending
4997,4998,18,2024-11-06,Tacoma,30780.39,0.02,Completed
4998,4999,10,2024-11-21,Corolla,22654.59,NaN,Completed
4999,5000,13,2024-11-21,Tundra,44525.85,NaN,Cancelled

In [10]:
toyota_data.dtypes

sale_id             int64
sale_rep_id         int64
sale_date          object
car_model          object
sale_amount       float64
commission_pct    float64
sale_status        object
dtype: object

In [11]:
toyota_data["sale_date"] = pd.to_datetime(toyota_data["sale_date"])

In [12]:
toyota_data.dtypes

sale_id                    int64
sale_rep_id                int64
sale_date         datetime64[ns]
car_model                 object
sale_amount              float64
commission_pct           float64
sale_status               object
dtype: object

In [14]:
toyota_data["car_model"] = toyota_data["car_model"].astype("category")

In [15]:
toyota_data["sale_status"] = toyota_data["sale_status"].astype("category")

In [16]:
toyota_data.dtypes

sale_id                    int64
sale_rep_id                int64
sale_date         datetime64[ns]
car_model               category
sale_amount              float64
commission_pct           float64
sale_status             category
dtype: object

In [17]:
toyota_data.nunique()

sale_id           5000
sale_rep_id         20
sale_date           30
car_model            6
sale_amount       4996
commission_pct       3
sale_status          3
dtype: int64

In [19]:
toyota_data[toyota_data["sale_status"] == "Completed"].sort_values(by="sale_date")

,sale_id,sale_rep_id,sale_date,car_model,sale_amount,commission_pct,sale_status
4445,4446,18,2024-11-01,Camry,26460.96,NaN,Completed
316,317,1,2024-11-01,Camry,27690.66,0.03,Completed
2728,2729,1,2024-11-01,Corolla,22248.02,0.05,Completed
153,154,20,2024-11-01,RAV4,27486.46,NaN,Completed
4097,4098,17,2024-11-01,Tundra,48422.66,NaN,Completed
...,...,...,...,...,...,...,...
2658,2659,17,2024-11-30,Camry,27133.62,0.03,Completed
3903,3904,19,2024-11-30,Camry,28494.06,0.02,Completed
745,746,9,2024-11-30,Highlander,41530.72,0.02,Completed
1024,1025,18,2024-11-30,Camry,26696.07,0.03,Completed
2631,2632,13,2024-11-30,RAV4,28041.83,0.05,Completed